12/data/attachments/1fd7ee7bb4f5b5b1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Melissa_more_Friend_69972_9</nif:username>
            <nif:friendToBeRequested>soap_friends_19249d94-f068-4de5-aefb-eeb0eb80a5e8</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>